Repository: vincenttran99/react-native-mono-template
Catalog: src/locale/locales/*/messages.po
Languages: vi

source: 3 or 4 times faster than normal scrolling screen
vi: Nhanh hơn 3 hoặc 4 lần so với màn hình cuộn bình thường

source: A template for your next React Native project, focusing on application performance optimization: Expo, TypeScript, ReStyle, Flashlist, Legend list, Husky, Lint-Staged, react-navigation, react-query, react-hook-form, Lingui, I18n, etc...
vi: Một mẫu cho dự án bản địa React React tiếp theo của bạn, tập trung vào tối ưu hóa hiệu suất ứng dụng: Expo, TypeScript, Restyle, flashlist, Legend Danh sách, Husky, Lint-Lint, React-Have

source: About us
vi: Về chúng tôi

source: Authentication flow implementation using Zustand and react-native-mmkv
vi: Việc thực hiện luồng xác thực bằng cách sử dụng Zustand và React-Bản địa-MMKV

source: Base components
vi: Các thành phần cơ sở

source: Button
vi: Cái nút

source: Button outline
vi: Đề cương nút

source: Button primary
vi: Nút chính

source: Button secondary
vi: Nút thứ cấp

source: Cancel
vi: Hủy bỏ

source: Cat
vi: Con mèo

source: Checkbox
vi: Hộp kiểm

source: Clear project structure with Absolute Imports
vi: Xóa cấu trúc dự án với nhập khẩu tuyệt đối

source: Close
vi: Đóng

source: Comment
vi: Bình luận

source: Comments
vi: Nhận xét

source: Confirm
vi: Xác nhận

source: Continue
vi: Tiếp tục

source: Customizable UI built with Shopify/restyle
vi: UI có thể tùy chỉnh được xây dựng với Shopify/Restyle

source: Dark Mode
vi: Chế độ tối

source: Demo list query
vi: Truy vấn danh sách demo

source: Divider
vi: Vách ngăn

source: E2E testing capabilities with Maestro for comprehensive app testing
vi: Khả năng kiểm tra E2E với MAESTRO để kiểm tra ứng dụng toàn diện

source: Easy multilingual integration within 30 seconds with Lingui
vi: Tích hợp đa ngôn ngữ dễ dàng trong vòng 30 giây với ngôn ngữ

source: Email is not valid
vi: Email không hợp lệ

source: Email should not be empty
vi: Email không nên trống

source: Empty
vi: Trống

source: Extra large warning text
vi: Văn bản cảnh báo thêm lớn

source: Fast and simple template
vi: Mẫu nhanh và đơn giản

source: Flash list
vi: Danh sách Flash

source: Flash List
vi: Danh sách Flash

source: Hello
vi: Xin chào

source: hide
vi: trốn

source: Husky for Git Hooks: Automate git hooks and enforce code standards
vi: Husky for git Hook: Tự động hóa các móc git và thực thi các tiêu chuẩn mã

source: I am committed to continuously improving this template to build React Native applications faster. To achieve this goal, I regularly add new features and fix discovered bugs.
vi: Tôi cam kết liên tục cải thiện mẫu này để xây dựng các ứng dụng tự nhiên phản ứng nhanh hơn. Để đạt được mục tiêu này, tôi thường xuyên thêm các tính năng mới và sửa lỗi phát hiện.

source: Icon Button
vi: Nút biểu tượng

source: Ignore
vi: Phớt lờ

source: Interesting components like multi-format text, collapsible/expandable text
vi: Các thành phần thú vị như văn bản đa định dạng, văn bản có thể thu gọn/có thể mở rộng

source: Introduce
vi: Giới thiệu

source: Introduction
vi: Giới thiệu

source: Key Features
vi: Các tính năng chính

source: Language
vi: Ngôn ngữ

source: Large success text
vi: Văn bản thành công lớn

source: Latest Expo SDK: Leverage the Expo ecosystem to the fullest
vi: SDK triển lãm mới nhất: Tận dụng hệ sinh thái hội chợ triển lãm đầy đủ nhất

source: Lazy view
vi: Quan điểm lười biếng

source: Like
vi: Giống

source: Liked
vi: Thích

source: Loadmore failed
vi: Loadmore không thành công

source: Login
vi: Đăng nhập

source: Login failed
vi: Đăng nhập không thành công

source: Login to continue
vi: Đăng nhập để tiếp tục

source: Maintenance and Development
vi: Bảo trì và phát triển

source: Medium primary text
vi: Văn bản chính trung bình

source: Multi text
vi: Nhiều văn bản

source: Network Error
vi: Lỗi mạng

source: No name
vi: Không có tên

source: Password should not be empty
vi: Mật khẩu không nên trống

source: Performance optimization with multiple compilation techniques
vi: Tối ưu hóa hiệu suất với nhiều kỹ thuật biên dịch

source: Performance Test
vi: Kiểm tra hiệu suất

source: Pressable
vi: Có thể ép

source: Preview URL
vi: Xem trước URL

source: Purpose
vi: Mục đích

source: React Query and axios for efficient data fetching
vi: React Truy vấn và Axios để tìm nạp dữ liệu hiệu quả

source: Render time:
vi: Thời gian kết xuất:

source: Robust form handling with react-hook-form
vi: Xử lý hình thức mạnh mẽ với hình thức phản ứng

source: Search
vi: Tìm kiếm

source: see more
vi: Xem thêm

source: Settings
vi: Cài đặt

source: Share
vi: Chia sẻ

source: Shares
vi: Cổ phiếu

source: Small error text
vi: Văn bản lỗi nhỏ

source: Something went wrong
vi: Có gì đó đã sai

source: Style native
vi: Phong cách bản địa

source: Style restyle
vi: Phong cách restyle

source: StyleSheet
vi: Biểu đồ kiểu

source: Support for multi-environment builds (Production, Staging, Development)
vi: Hỗ trợ cho các bản dựng đa môi trường (sản xuất, dàn dựng, phát triển)

source: Suprise! You are seeing this text after 2 seconds
vi: Sự ngạc nhiên! Bạn đang xem văn bản này sau 2 giây

source: Surface
vi: Bề mặt

source: Text Ellipsis
vi: Văn bản Ellipsis

source: Text input
vi: Đầu vào văn bản

source: This is a long text. This is a long text. This is a long text. This is a long text. This is a long text. This is a long text. This is a long text. This is a long text. This is a long text. This is a long text. This is a long text. This is a long text. This is a long text. This is a long text. This is a long text. This is a long text. This is a long text. This is a long text.
vi: Đây là một văn bản dài. Đây là một văn bản dài. Đây là một văn bản dài. Đây là một văn bản dài. Đây là một văn bản dài. Đây là một văn bản dài. Đây là một văn bản dài. Đây là một văn bản dài. Đây là một văn bản dài. Đây là một văn bản dài. Đây là một văn bản dài. Đây là một văn bản dài. Đây là một văn bản dài. Đây là một văn bản dài. Đây là một văn bản dài. Đây là một văn bản dài. Đây là một văn bản dài. Đây là một văn bản dài.

source: This project is licensed under MIT.
vi: Dự án này được cấp phép theo MIT.

source: TypeScript to enhance code quality and prevent errors
vi: TypeScript để nâng cao chất lượng mã và ngăn ngừa lỗi

source: Unit testing setup with Jest and React Testing Library
vi: Thiết lập kiểm tra đơn vị với thư viện kiểm tra Jest và React

source: View Documentation
vi: Xem tài liệu

source: View on GitHub
vi: Xem trên GitHub

source: We have 200 images at the bottom
vi: Chúng tôi có 200 hình ảnh ở phía dưới

source: Welcome to
vi: Chào mừng bạn đến

source: Your email
vi: Email của bạn

source: Your password
vi: Mật khẩu của bạn
